<?php

namespace lib\Keywords;

class Keywords {

static public $common_ru = array(
  'а', 'благо', 'более', 'больше', 'буквально', 'бывает', 'бывало', 'было', 'будто', 'ведь', 'во', 'вовсе', 
  'вон', 'вот', 'вроде', 'всё', 'всего', 'где', 'гляди', 'да', 'давай','давайте', 'даже', 'дай', 'дайте',
  'действительно', 'единственно', 'если', 'еще', 'знай', 'и', 'или', 'именно', 'как', 'какое', 
  'куда', 'ладно', 'ли', 'лучше', 'никак', 'ничего', 'нечего', 'но', 'однако', 'окончательно', 
  'оно', 'поди', 'положительно', 'просто', 'прямо', 'пусть', 'пускай', 'разве', 'решительно', 
  'ровно', 'самое', 'себе', 'скорее', 'словно', 'совершенно', 'спасибо', 'так', 'там', 'тебе', 
  'тоже', 'только', 'точно', 'хоть', 'чего', 'чисто', 'что', 'чтоб', 'чтобы', 'эк', 'это',
  'буквально', 'благо', 'во', 'вовсе', 'вон', 'вот', 'где', 'действительно', 'единственно', 
  'еще', 'именно', 'как', 'куда', 'ладно', 'нечего', 'ничего', 'окончательно', 'положительно', 
  'просто', 'прямо', 'решительно', 'совершенно', 'совсем', 'так', 'там', 'хорошо','уж','как', 'вроде',
  'я', 'ты', 'он', 'она', 'оно', 'мы', 'вы', 'себя', 'себе', 'мой', 'мои', 'наш', 'наши', 'твой', 
  'ваш', 'твои', 'ваши', 'его', 'её', 'ее', 'их', 'свой', 'свои', 'кто', 'что', 'сколько', 'какой',
  'каков', 'чей', 'коорый', 'куда', 'когда', 'зачем', 'почему', 'сколько', 'этот', 'это', 'тот', 'такой',
  'таков', 'то', 'этакий', 'оный', 'сей', 'экий', 'об', 'о', 'все', 'всё', 'весь', 'всякий', 'сам', 
  'самый', 'само', 'каждый', 'любой', 'другой', 'иной', 'никтого', 'ничто', 'нечего', 'никакой', 'ничей', 
  'негде', 'некуда', 'никогда', 'незачем', 'никак', 'некто', 'нечто', 'некий', 'некоторый', 'несколько', 
  'туда', 'тот', 'там', 'тогда', 'сей', 'сяк', 'сюда', 'сям', 'здесь', 'когда', 'весь', 'всяк', 'всюду', 
  'везде', 'всегда', 'иной', 'иначе', 'иногда', 'быть', 'иметь', 'один из', 'какой-то', 'любой', 'вчера',
  'сегодня', 'завтра', 'утром', 'днём', 'вечером', 'ночью', 'весной', 'сейчас', 'позже', 'погодя', 'далеко',
  'рядом', 'вдали', 'вблизи', 'здесь', 'там', 'направо', 'налево', 'назад', 'издали', 'навстречу', 'сбоку', 
  'сослепу', 'сгоряча', 'сдуру', 'спьяну', 'поневоле', 'недаром', '(нарочно', 'специально', 'назло', 'наперекор',
  'в шутку', 'умышленно', 'неумышленно', 'нечаянно', 'холодно', 'зверски', 'грустно', 'странно', 'чудовищно', 
  'страшно', 'быстро', 'правильно', 'много', 'мало', 'чуть-чуть', 'вдвойне', 'втройне', 'дважды', 'трижды', 
  'вдвоём', 'втроём', 'вшестером', 'очень', 'весьма', 'совершенно', 'абсолютно', 'бегом', 'галопом', 'шагом', 
  'вплавь', 'вперемешку', 'вхолостую', 'навзничь', 'наверняка', 'по-бабьи', 'по-медвежьи', 
  'по-старому', 'по-нашему', 'по-приятельски', 'по-прежнему', 'торчком', 'загогулиной', 'дыбом', 'ёжиком', 
  'столбом', 'вдвоём', 'втроём', 'всенародно', 'сообща', 'в', 'без', 'до', 'из', 'к', 'на', 'по', 'о', 'от', 
  'перед', 'при', 'через', 'с', 'у', 'и', 'нет', 'за', 'над', 'для', 'об', 'под', 'про', 'вблизи', 'вглубь', 
  'вдоль', 'возле', 'около', 'вокруг', 'впереди', 'после', 'посредством', 'путем', 'насчет', 
  'ввиду'); 
  
static public $common_en = array( 
  'a','about','after','all','almost','along','also','although','amp','an','and','another','any','are',
  'area','arent','around','as','at','available','back','be','because','been','before','being','best',
  'better','big','bit','both','but','by','c','came','can','capable','control','could','course','d',
  'dan','day','decided','did','didn','different','div','do','doesn','don','down','drive','e','each',
  'easily','easy','edition','either','end','enough','even','every','example','few','find','first',
  'for','found','from','get','go','going','good','got','gt','had','hard','has','have','he','her',
  'here','how','i','if','in','into','is','isn','it','just','know','last','left','li','like','little',
  'll','long','look','lot','lt','m','made','make','many','mb','me','menu','might','mm','more',
  'most','much','my','name','nbsp','need','new','no','not','now','number','of','off','old','on',
  'one','only','or','original','other','our','out','over','part','place','point','pretty','probably',
  'problem','put','quite','quot','r','re','really','results','right','s','same','saw','see','set',
  'several','she','sherree','should','since','size','small','so','some','something','special',
  'still','stuff','such','sure','system','t','take','than','that','the','their','them','then',
  'there','these','they','thing','things','think','this','those','though','through','time','to',
  'today','together','too','took','two','up','us','use','used','using','ve','very','want','was',
  'way','we','well','went','were','what','when','where','which','while','white','who','will',
  'with','would','yet','you','your','yours');

static public $common_chars = array('(', ')', ':','.',',','<', '>','\\','/','?', '-','-','-','&','#',';','+','*','!','"','$','^','=');
static public $common_nums = array('0', '1', '2','3','4','5', '6','7','8','9');
  
 static public function get($content){
 
   $replace = array_merge(self::$common_chars, self::$common_en, self::$common_ru, self::$common_nums);
   $words =  explode(' ', $content);
        
   $ret = array();
   if ( ! empty($words)) {
     foreach ($words as $i => $term) {
     
       if (empty($term)) {
         continue;
       }
       
       $lower = mb_strtolower(trim($term), 'UTF-8');
                
       if(mb_strlen($lower,'UTF-8')<3){
         continue;
       }
                
       if (in_array($lower, $replace)) {
         continue;
       }

       if (is_numeric($lower)) {
         continue;
       }
                
       $ret[$i] = $lower;
     }
   }
   
   return $ret;
 }
  
}?>